<template>
  <v-container>

    <v-card class="mb-5">
      <v-card-title>
        Найти максимальную степень 2 на которую делится данное целое число
      </v-card-title>
      <v-card-subtitle>Операторами цикла пользоваться нельзя</v-card-subtitle>
    </v-card>

    <v-card class="mb-5">
      <v-card-text>
        <NumberInput
            v-model="value"
            label="Введите число в двоичном виде (x)"
            binary
            :length="32"
        />
      </v-card-text>
      <v-card-title>
        СТЕПЕНЬ: {{ getResult }}
      </v-card-title>
    </v-card>

    <v-card>
      <v-card-text>
        <v-expansion-panels>
          <v-expansion-panel>
            <v-expansion-panel-header>Код реализации без циклов</v-expansion-panel-header>
            <v-expansion-panel-content>
              <pre>
const num = +new Bin(0, 32).setBin(this.value).toNum()
if (num === 0b1000_0000_0000_0000_0000_0000_0000_0000) return 31
if (num === 0b0100_0000_0000_0000_0000_0000_0000_0000) return 30
if (num === 0b0010_0000_0000_0000_0000_0000_0000_0000) return 29
if (num === 0b0001_0000_0000_0000_0000_0000_0000_0000) return 28
if (num === 0b0000_1000_0000_0000_0000_0000_0000_0000) return 27
if (num === 0b0000_0100_0000_0000_0000_0000_0000_0000) return 26
if (num === 0b0000_0010_0000_0000_0000_0000_0000_0000) return 25
if (num === 0b0000_0001_0000_0000_0000_0000_0000_0000) return 24
if (num === 0b0000_0000_1000_0000_0000_0000_0000_0000) return 23
if (num === 0b0000_0000_0100_0000_0000_0000_0000_0000) return 22
if (num === 0b0000_0000_0010_0000_0000_0000_0000_0000) return 21
if (num === 0b0000_0000_0001_0000_0000_0000_0000_0000) return 20
if (num === 0b0000_0000_0000_1000_0000_0000_0000_0000) return 19
if (num === 0b0000_0000_0000_0100_0000_0000_0000_0000) return 18
if (num === 0b0000_0000_0000_0010_0000_0000_0000_0000) return 17
if (num === 0b0000_0000_0000_0001_0000_0000_0000_0000) return 16
if (num === 0b0000_0000_0000_0000_1000_0000_0000_0000) return 15
if (num === 0b0000_0000_0000_0000_0100_0000_0000_0000) return 14
if (num === 0b0000_0000_0000_0000_0010_0000_0000_0000) return 13
if (num === 0b0000_0000_0000_0000_0001_0000_0000_0000) return 12
if (num === 0b0000_0000_0000_0000_0000_1000_0000_0000) return 11
if (num === 0b0000_0000_0000_0000_0000_0100_0000_0000) return 10
if (num === 0b0000_0000_0000_0000_0000_0010_0000_0000) return 9
if (num === 0b0000_0000_0000_0000_0000_0001_0000_0000) return 8
if (num === 0b0000_0000_0000_0000_0000_0000_1000_0000) return 7
if (num === 0b0000_0000_0000_0000_0000_0000_0100_0000) return 6
if (num === 0b0000_0000_0000_0000_0000_0000_0010_0000) return 5
if (num === 0b0000_0000_0000_0000_0000_0000_0001_0000) return 4
if (num === 0b0000_0000_0000_0000_0000_0000_0000_1000) return 3
if (num === 0b0000_0000_0000_0000_0000_0000_0000_0100) return 2
if (num === 0b0000_0000_0000_0000_0000_0000_0000_0010) return 1
if (num === 0b0000_0000_0000_0000_0000_0000_0000_0001) return 0
return 'Не делится'
              </pre>
            </v-expansion-panel-content>
          </v-expansion-panel>
        </v-expansion-panels>
      </v-card-text>
    </v-card>

  </v-container>
</template>

<script>
import Bin from '@/libs/bin.js'
import NumberInput from '@/components/NumberInput'

export default {
  components: {
    NumberInput,
  },

  data: () => ({
    value: '',
  }),

  computed: {
    getResult() {
      const num = +new Bin(0, 32).setBin(this.value).toNum()
      if (num === 0b1000_0000_0000_0000_0000_0000_0000_0000) return 31
      if (num === 0b0100_0000_0000_0000_0000_0000_0000_0000) return 30
      if (num === 0b0010_0000_0000_0000_0000_0000_0000_0000) return 29
      if (num === 0b0001_0000_0000_0000_0000_0000_0000_0000) return 28
      if (num === 0b0000_1000_0000_0000_0000_0000_0000_0000) return 27
      if (num === 0b0000_0100_0000_0000_0000_0000_0000_0000) return 26
      if (num === 0b0000_0010_0000_0000_0000_0000_0000_0000) return 25
      if (num === 0b0000_0001_0000_0000_0000_0000_0000_0000) return 24
      if (num === 0b0000_0000_1000_0000_0000_0000_0000_0000) return 23
      if (num === 0b0000_0000_0100_0000_0000_0000_0000_0000) return 22
      if (num === 0b0000_0000_0010_0000_0000_0000_0000_0000) return 21
      if (num === 0b0000_0000_0001_0000_0000_0000_0000_0000) return 20
      if (num === 0b0000_0000_0000_1000_0000_0000_0000_0000) return 19
      if (num === 0b0000_0000_0000_0100_0000_0000_0000_0000) return 18
      if (num === 0b0000_0000_0000_0010_0000_0000_0000_0000) return 17
      if (num === 0b0000_0000_0000_0001_0000_0000_0000_0000) return 16
      if (num === 0b0000_0000_0000_0000_1000_0000_0000_0000) return 15
      if (num === 0b0000_0000_0000_0000_0100_0000_0000_0000) return 14
      if (num === 0b0000_0000_0000_0000_0010_0000_0000_0000) return 13
      if (num === 0b0000_0000_0000_0000_0001_0000_0000_0000) return 12
      if (num === 0b0000_0000_0000_0000_0000_1000_0000_0000) return 11
      if (num === 0b0000_0000_0000_0000_0000_0100_0000_0000) return 10
      if (num === 0b0000_0000_0000_0000_0000_0010_0000_0000) return 9
      if (num === 0b0000_0000_0000_0000_0000_0001_0000_0000) return 8
      if (num === 0b0000_0000_0000_0000_0000_0000_1000_0000) return 7
      if (num === 0b0000_0000_0000_0000_0000_0000_0100_0000) return 6
      if (num === 0b0000_0000_0000_0000_0000_0000_0010_0000) return 5
      if (num === 0b0000_0000_0000_0000_0000_0000_0001_0000) return 4
      if (num === 0b0000_0000_0000_0000_0000_0000_0000_1000) return 3
      if (num === 0b0000_0000_0000_0000_0000_0000_0000_0100) return 2
      if (num === 0b0000_0000_0000_0000_0000_0000_0000_0010) return 1
      if (num === 0b0000_0000_0000_0000_0000_0000_0000_0001) return 0
      return 'Не делится'
    },
  },
}
</script>
